---
type: JournalingAttribute
namespace: Autodesk.Revit.Attributes
version: 2024
members: 2
tags: [revit-api, class]
---

# JournalingAttribute

`Autodesk.Revit.Attributes.JournalingAttribute` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | JournalingAttribute | 2011 | `public JournalingAttribute ( JournalingMode mode )` |
| Property | Mode | 2011 | `public JournalingMode Mode { get ; }` |